Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_fdcan1.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32H747_CM4_fdcan1 equates.
 */

#pragma once

#include    <stdint.h>

// FDCAN1 address definitions
// --------------------------

typedef struct {
    volatile    uint32_t    CREL;
    volatile    uint32_t    ENDN;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    DBTP;
    volatile    uint32_t    TEST;
    volatile    uint32_t    RWD;
    volatile    uint32_t    CCCR;
    volatile    uint32_t    NBTP;
    volatile    uint32_t    TSCC;
    volatile    uint32_t    TSCV;
    volatile    uint32_t    TOCC;
    volatile    uint32_t    TOCV;
    volatile    uint32_t    RESERVED1[4];
    volatile    uint32_t    ECR;
    volatile    uint32_t    PSR;
    volatile    uint32_t    TDCR;
    volatile    uint32_t    RESERVED2;
    volatile    uint32_t    IR;
    volatile    uint32_t    IE;
    volatile    uint32_t    ILS;
    volatile    uint32_t    ILE;
    volatile    uint32_t    RESERVED3[8];
    volatile    uint32_t    GFC;
    volatile    uint32_t    SIDFC;
    volatile    uint32_t    XIDFC;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    XIDAM;
    volatile    uint32_t    HPMS;
    volatile    uint32_t    NDAT1;
    volatile    uint32_t    NDAT2;
    volatile    uint32_t    RXF0C;
    volatile    uint32_t    RXF0S;
    volatile    uint32_t    RXF0A;
    volatile    uint32_t    RXBC;
    volatile    uint32_t    RXF1C;
    volatile    uint32_t    RXF1S;
    volatile    uint32_t    RXF1A;
    volatile    uint32_t    RXESC;
    volatile    uint32_t    TXBC;
    volatile    uint32_t    TXFQS;
    volatile    uint32_t    TXESC;
    volatile    uint32_t    TXBRP;
    volatile    uint32_t    TXBAR;
    volatile    uint32_t    TXBCR;
    volatile    uint32_t    TXBTO;
    volatile    uint32_t    TXBCF;
    volatile    uint32_t    TXBTIE;
    volatile    uint32_t    TXBCIE;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    TXEFC;
    volatile    uint32_t    TXEFS;
    volatile    uint32_t    TXEFA;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    TTTMC;
    volatile    uint32_t    TTRMC;
    volatile    uint32_t    TTOCF;
    volatile    uint32_t    TTMLM;
    volatile    uint32_t    TURCF;
    volatile    uint32_t    TTOCN;
    volatile    uint32_t    CAN_TTGTP;
    volatile    uint32_t    TTTMK;
    volatile    uint32_t    TTIR;
    volatile    uint32_t    TTIE;
    volatile    uint32_t    TTILS;
    volatile    uint32_t    TTOST;
    volatile    uint32_t    TURNA;
    volatile    uint32_t    TTLGT;
    volatile    uint32_t    TTCTC;
    volatile    uint32_t    TTCPT;
    volatile    uint32_t    TTCSM;
    volatile    uint32_t    RESERVED7[111];
    volatile    uint32_t    TTTS;
} FDCAN1_TypeDef;

#ifdef __cplusplus
#define FDCAN1  reinterpret_cast<FDCAN1_TypeDef *>(0x4000A000U)

#else
#define FDCAN1  ((FDCAN1_TypeDef *)0x4000A000U)
#endif

// CREL Configuration

#define FDCAN1_CREL_DAY         (0xFFU<<0)
#define FDCAN1_CREL_DAY_0       (0x1U<<0)
#define FDCAN1_CREL_MON         (0xFFU<<8)
#define FDCAN1_CREL_MON_0       (0x1U<<8)
#define FDCAN1_CREL_YEAR        (0xFU<<16)
#define FDCAN1_CREL_YEAR_0      (0x1U<<16)
#define FDCAN1_CREL_SUBSTEP     (0xFU<<20)
#define FDCAN1_CREL_SUBSTEP_0   (0x1U<<20)
#define FDCAN1_CREL_STEP        (0xFU<<24)
#define FDCAN1_CREL_STEP_0      (0x1U<<24)
#define FDCAN1_CREL_REL         (0xFU<<28)
#define FDCAN1_CREL_REL_0       (0x1U<<28)

// ENDN Configuration

#define FDCAN1_ENDN_ETV         (0xFFFFFFFFU<<0)
#define FDCAN1_ENDN_ETV_0       (0x1U<<0)

// DBTP Configuration

#define FDCAN1_DBTP_TDC         (0x1U<<23)
#define FDCAN1_DBTP_DBRP        (0x1FU<<16)
#define FDCAN1_DBTP_DBRP_0      (0x1U<<16)
#define FDCAN1_DBTP_DTSEG1      (0x1FU<<8)
#define FDCAN1_DBTP_DTSEG1_0    (0x1U<<8)
#define FDCAN1_DBTP_DTSEG2      (0xFU<<4)
#define FDCAN1_DBTP_DTSEG2_0    (0x1U<<4)
#define FDCAN1_DBTP_DSJW        (0xFU<<0)
#define FDCAN1_DBTP_DSJW_0      (0x1U<<0)

// TEST Configuration

#define FDCAN1_TEST_RX          (0x1U<<7)
#define FDCAN1_TEST_TX          (0x3U<<5)
#define FDCAN1_TEST_TX_0        (0x1U<<5)
#define FDCAN1_TEST_LBCK        (0x1U<<4)

// RWD Configuration

#define FDCAN1_RWD_WDC          (0xFFU<<0)
#define FDCAN1_RWD_WDC_0        (0x1U<<0)
#define FDCAN1_RWD_WDV          (0xFFU<<8)
#define FDCAN1_RWD_WDV_0        (0x1U<<8)

// CCCR Configuration

#define FDCAN1_CCCR_NISO        (0x1U<<15)
#define FDCAN1_CCCR_TXP         (0x1U<<14)
#define FDCAN1_CCCR_EFBI        (0x1U<<13)
#define FDCAN1_CCCR_PXHD        (0x1U<<12)
#define FDCAN1_CCCR_BSE         (0x1U<<9)
#define FDCAN1_CCCR_FDOE        (0x1U<<8)
#define FDCAN1_CCCR_TEST        (0x1U<<7)
#define FDCAN1_CCCR_DAR         (0x1U<<6)
#define FDCAN1_CCCR_MON         (0x1U<<5)
#define FDCAN1_CCCR_CSR         (0x1U<<4)
#define FDCAN1_CCCR_CSA         (0x1U<<3)
#define FDCAN1_CCCR_ASM         (0x1U<<2)
#define FDCAN1_CCCR_CCE         (0x1U<<1)
#define FDCAN1_CCCR_INIT        (0x1U<<0)

// NBTP Configuration

#define FDCAN1_NBTP_TSEG2       (0x7FU<<0)
#define FDCAN1_NBTP_TSEG2_0     (0x1U<<0)
#define FDCAN1_NBTP_NTSEG1      (0xFFU<<8)
#define FDCAN1_NBTP_NTSEG1_0    (0x1U<<8)
#define FDCAN1_NBTP_NBRP        (0x1FFU<<16)
#define FDCAN1_NBTP_NBRP_0      (0x1U<<16)
#define FDCAN1_NBTP_NSJW        (0x7FU<<25)
#define FDCAN1_NBTP_NSJW_0      (0x1U<<25)

// TSCC Configuration

#define FDCAN1_TSCC_TSS         (0x3U<<0)
#define FDCAN1_TSCC_TSS_0       (0x1U<<0)
#define FDCAN1_TSCC_TCP         (0xFU<<16)
#define FDCAN1_TSCC_TCP_0       (0x1U<<16)

// TSCV Configuration

#define FDCAN1_TSCV_TSC         (0xFFFFU<<0)
#define FDCAN1_TSCV_TSC_0       (0x1U<<0)

// TOCC Configuration

#define FDCAN1_TOCC_TOP         (0xFFFFU<<16)
#define FDCAN1_TOCC_TOP_0       (0x1U<<16)
#define FDCAN1_TOCC_TOS         (0x3U<<1)
#define FDCAN1_TOCC_TOS_0       (0x1U<<1)
#define FDCAN1_TOCC_ETOC        (0x1U<<0)

// TOCV Configuration

#define FDCAN1_TOCV_TOC         (0xFFFFU<<0)
#define FDCAN1_TOCV_TOC_0       (0x1U<<0)

// ECR Configuration

#define FDCAN1_ECR_TEC          (0xFFU<<0)
#define FDCAN1_ECR_TEC_0        (0x1U<<0)
#define FDCAN1_ECR_TREC         (0x7FU<<8)
#define FDCAN1_ECR_TREC_0       (0x1U<<8)
#define FDCAN1_ECR_RP           (0x1U<<15)
#define FDCAN1_ECR_CEL          (0xFFU<<16)
#define FDCAN1_ECR_CEL_0        (0x1U<<16)

// PSR Configuration

#define FDCAN1_PSR_TDCV         (0x7FU<<16)
#define FDCAN1_PSR_TDCV_0       (0x1U<<16)
#define FDCAN1_PSR_PXE          (0x1U<<14)
#define FDCAN1_PSR_REDL         (0x1U<<13)
#define FDCAN1_PSR_RBRS         (0x1U<<12)
#define FDCAN1_PSR_RESI         (0x1U<<11)
#define FDCAN1_PSR_DLEC         (0x7U<<8)
#define FDCAN1_PSR_DLEC_0       (0x1U<<8)
#define FDCAN1_PSR_BO           (0x1U<<7)
#define FDCAN1_PSR_EW           (0x1U<<6)
#define FDCAN1_PSR_EP           (0x1U<<5)
#define FDCAN1_PSR_ACT          (0x3U<<3)
#define FDCAN1_PSR_ACT_0        (0x1U<<3)
#define FDCAN1_PSR_LEC          (0x7U<<0)
#define FDCAN1_PSR_LEC_0        (0x1U<<0)

// TDCR Configuration

#define FDCAN1_TDCR_TDCO        (0x7FU<<8)
#define FDCAN1_TDCR_TDCO_0      (0x1U<<8)
#define FDCAN1_TDCR_TDCF        (0x7FU<<0)
#define FDCAN1_TDCR_TDCF_0      (0x1U<<0)

