Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_fdcan1.h
// IR Configuration

#define FDCAN1_IR_ARA           (0x1U<<29)
#define FDCAN1_IR_PED           (0x1U<<28)
#define FDCAN1_IR_PEA           (0x1U<<27)
#define FDCAN1_IR_WDI           (0x1U<<26)
#define FDCAN1_IR_BO            (0x1U<<25)
#define FDCAN1_IR_EW            (0x1U<<24)
#define FDCAN1_IR_EP            (0x1U<<23)
#define FDCAN1_IR_ELO           (0x1U<<22)
#define FDCAN1_IR_DRX           (0x1U<<19)
#define FDCAN1_IR_TOO           (0x1U<<18)
#define FDCAN1_IR_MRAF          (0x1U<<17)
#define FDCAN1_IR_TSW           (0x1U<<16)
#define FDCAN1_IR_TEFL          (0x1U<<15)
#define FDCAN1_IR_TEFF          (0x1U<<14)
#define FDCAN1_IR_TEFW          (0x1U<<13)
#define FDCAN1_IR_TEFN          (0x1U<<12)
#define FDCAN1_IR_TEF           (0x1U<<11)
#define FDCAN1_IR_TCF           (0x1U<<10)
#define FDCAN1_IR_TC            (0x1U<<9)
#define FDCAN1_IR_HPM           (0x1U<<8)
#define FDCAN1_IR_RF1L          (0x1U<<7)
#define FDCAN1_IR_RF1F          (0x1U<<6)
#define FDCAN1_IR_RF1W          (0x1U<<5)
#define FDCAN1_IR_RF1N          (0x1U<<4)
#define FDCAN1_IR_RF0L          (0x1U<<3)
#define FDCAN1_IR_RF0F          (0x1U<<2)
#define FDCAN1_IR_RF0W          (0x1U<<1)
#define FDCAN1_IR_RF0N          (0x1U<<0)

// IE Configuration

#define FDCAN1_IE_ARAE          (0x1U<<29)
#define FDCAN1_IE_PEDE          (0x1U<<28)
#define FDCAN1_IE_PEAE          (0x1U<<27)
#define FDCAN1_IE_WDIE          (0x1U<<26)
#define FDCAN1_IE_BOE           (0x1U<<25)
#define FDCAN1_IE_EWE           (0x1U<<24)
#define FDCAN1_IE_EPE           (0x1U<<23)
#define FDCAN1_IE_ELOE          (0x1U<<22)
#define FDCAN1_IE_BEUE          (0x1U<<21)
#define FDCAN1_IE_BECE          (0x1U<<20)
#define FDCAN1_IE_DRXE          (0x1U<<19)
#define FDCAN1_IE_TOOE          (0x1U<<18)
#define FDCAN1_IE_MRAFE         (0x1U<<17)
#define FDCAN1_IE_TSWE          (0x1U<<16)
#define FDCAN1_IE_TEFLE         (0x1U<<15)
#define FDCAN1_IE_TEFFE         (0x1U<<14)
#define FDCAN1_IE_TEFWE         (0x1U<<13)
#define FDCAN1_IE_TEFNE         (0x1U<<12)
#define FDCAN1_IE_TEFE          (0x1U<<11)
#define FDCAN1_IE_TCFE          (0x1U<<10)
#define FDCAN1_IE_TCE           (0x1U<<9)
#define FDCAN1_IE_HPME          (0x1U<<8)
#define FDCAN1_IE_RF1LE         (0x1U<<7)
#define FDCAN1_IE_RF1FE         (0x1U<<6)
#define FDCAN1_IE_RF1WE         (0x1U<<5)
#define FDCAN1_IE_RF1NE         (0x1U<<4)
#define FDCAN1_IE_RF0LE         (0x1U<<3)
#define FDCAN1_IE_RF0FE         (0x1U<<2)
#define FDCAN1_IE_RF0WE         (0x1U<<1)
#define FDCAN1_IE_RF0NE         (0x1U<<0)

// ILS Configuration

#define FDCAN1_ILS_ARAL         (0x1U<<29)
#define FDCAN1_ILS_PEDL         (0x1U<<28)
#define FDCAN1_ILS_PEAL         (0x1U<<27)
#define FDCAN1_ILS_WDIL         (0x1U<<26)
#define FDCAN1_ILS_BOL          (0x1U<<25)
#define FDCAN1_ILS_EWL          (0x1U<<24)
#define FDCAN1_ILS_EPL          (0x1U<<23)
#define FDCAN1_ILS_ELOL         (0x1U<<22)
#define FDCAN1_ILS_BEUL         (0x1U<<21)
#define FDCAN1_ILS_BECL         (0x1U<<20)
#define FDCAN1_ILS_DRXL         (0x1U<<19)
#define FDCAN1_ILS_TOOL         (0x1U<<18)
#define FDCAN1_ILS_MRAFL        (0x1U<<17)
#define FDCAN1_ILS_TSWL         (0x1U<<16)
#define FDCAN1_ILS_TEFLL        (0x1U<<15)
#define FDCAN1_ILS_TEFFL        (0x1U<<14)
#define FDCAN1_ILS_TEFWL        (0x1U<<13)
#define FDCAN1_ILS_TEFNL        (0x1U<<12)
#define FDCAN1_ILS_TEFL         (0x1U<<11)
#define FDCAN1_ILS_TCFL         (0x1U<<10)
#define FDCAN1_ILS_TCL          (0x1U<<9)
#define FDCAN1_ILS_HPML         (0x1U<<8)
#define FDCAN1_ILS_RF1LL        (0x1U<<7)
#define FDCAN1_ILS_RF1FL        (0x1U<<6)
#define FDCAN1_ILS_RF1WL        (0x1U<<5)
#define FDCAN1_ILS_RF1NL        (0x1U<<4)
#define FDCAN1_ILS_RF0LL        (0x1U<<3)
#define FDCAN1_ILS_RF0FL        (0x1U<<2)
#define FDCAN1_ILS_RF0WL        (0x1U<<1)
#define FDCAN1_ILS_RF0NL        (0x1U<<0)

// ILE Configuration

#define FDCAN1_ILE_EINT1        (0x1U<<1)
#define FDCAN1_ILE_EINT0        (0x1U<<0)

// GFC Configuration

#define FDCAN1_GFC_ANFS         (0x3U<<4)
#define FDCAN1_GFC_ANFS_0       (0x1U<<4)
#define FDCAN1_GFC_ANFE         (0x3U<<2)
#define FDCAN1_GFC_ANFE_0       (0x1U<<2)
#define FDCAN1_GFC_RRFS         (0x1U<<1)
#define FDCAN1_GFC_RRFE         (0x1U<<0)

// SIDFC Configuration

#define FDCAN1_SIDFC_LSS        (0xFFU<<16)
#define FDCAN1_SIDFC_LSS_0      (0x1U<<16)
#define FDCAN1_SIDFC_FLSSA      (0x3FFFU<<2)
#define FDCAN1_SIDFC_FLSSA_0    (0x1U<<2)

// XIDFC Configuration

#define FDCAN1_XIDFC_LSE        (0xFFU<<16)
#define FDCAN1_XIDFC_LSE_0      (0x1U<<16)
#define FDCAN1_XIDFC_FLESA      (0x3FFFU<<2)
#define FDCAN1_XIDFC_FLESA_0    (0x1U<<2)

// XIDAM Configuration

#define FDCAN1_XIDAM_EIDM       (0x1FFFFFFFU<<0)
#define FDCAN1_XIDAM_EIDM_0     (0x1U<<0)

// HPMS Configuration

#define FDCAN1_HPMS_FLST        (0x1U<<15)
#define FDCAN1_HPMS_FIDX        (0x7FU<<8)
#define FDCAN1_HPMS_FIDX_0      (0x1U<<8)
#define FDCAN1_HPMS_MSI         (0x3U<<6)
#define FDCAN1_HPMS_MSI_0       (0x1U<<6)
#define FDCAN1_HPMS_BIDX        (0x3FU<<0)
#define FDCAN1_HPMS_BIDX_0      (0x1U<<0)

// NDAT1 Configuration

#define FDCAN1_NDAT1_ND31       (0x1U<<31)
#define FDCAN1_NDAT1_ND30       (0x1U<<30)
#define FDCAN1_NDAT1_ND29       (0x1U<<29)
#define FDCAN1_NDAT1_ND28       (0x1U<<28)
#define FDCAN1_NDAT1_ND27       (0x1U<<27)
#define FDCAN1_NDAT1_ND26       (0x1U<<26)
#define FDCAN1_NDAT1_ND25       (0x1U<<25)
#define FDCAN1_NDAT1_ND24       (0x1U<<24)
#define FDCAN1_NDAT1_ND23       (0x1U<<23)
#define FDCAN1_NDAT1_ND22       (0x1U<<22)
#define FDCAN1_NDAT1_ND21       (0x1U<<21)
#define FDCAN1_NDAT1_ND20       (0x1U<<20)
#define FDCAN1_NDAT1_ND19       (0x1U<<19)
#define FDCAN1_NDAT1_ND18       (0x1U<<18)
#define FDCAN1_NDAT1_ND17       (0x1U<<17)
#define FDCAN1_NDAT1_ND16       (0x1U<<16)
#define FDCAN1_NDAT1_ND15       (0x1U<<15)
#define FDCAN1_NDAT1_ND14       (0x1U<<14)
#define FDCAN1_NDAT1_ND13       (0x1U<<13)
#define FDCAN1_NDAT1_ND12       (0x1U<<12)
#define FDCAN1_NDAT1_ND11       (0x1U<<11)
#define FDCAN1_NDAT1_ND10       (0x1U<<10)
#define FDCAN1_NDAT1_ND9        (0x1U<<9)
#define FDCAN1_NDAT1_ND8        (0x1U<<8)
#define FDCAN1_NDAT1_ND7        (0x1U<<7)
#define FDCAN1_NDAT1_ND6        (0x1U<<6)
#define FDCAN1_NDAT1_ND5        (0x1U<<5)
#define FDCAN1_NDAT1_ND4        (0x1U<<4)
#define FDCAN1_NDAT1_ND3        (0x1U<<3)
#define FDCAN1_NDAT1_ND2        (0x1U<<2)
#define FDCAN1_NDAT1_ND1        (0x1U<<1)
#define FDCAN1_NDAT1_ND0        (0x1U<<0)

// NDAT2 Configuration

#define FDCAN1_NDAT2_ND63       (0x1U<<31)
#define FDCAN1_NDAT2_ND62       (0x1U<<30)
#define FDCAN1_NDAT2_ND61       (0x1U<<29)
#define FDCAN1_NDAT2_ND60       (0x1U<<28)
#define FDCAN1_NDAT2_ND59       (0x1U<<27)
#define FDCAN1_NDAT2_ND58       (0x1U<<26)
#define FDCAN1_NDAT2_ND57       (0x1U<<25)
#define FDCAN1_NDAT2_ND56       (0x1U<<24)
#define FDCAN1_NDAT2_ND55       (0x1U<<23)
#define FDCAN1_NDAT2_ND54       (0x1U<<22)
#define FDCAN1_NDAT2_ND53       (0x1U<<21)
#define FDCAN1_NDAT2_ND52       (0x1U<<20)
#define FDCAN1_NDAT2_ND51       (0x1U<<19)
#define FDCAN1_NDAT2_ND50       (0x1U<<18)
#define FDCAN1_NDAT2_ND49       (0x1U<<17)
#define FDCAN1_NDAT2_ND48       (0x1U<<16)
#define FDCAN1_NDAT2_ND47       (0x1U<<15)
#define FDCAN1_NDAT2_ND46       (0x1U<<14)
#define FDCAN1_NDAT2_ND45       (0x1U<<13)
#define FDCAN1_NDAT2_ND44       (0x1U<<12)
#define FDCAN1_NDAT2_ND43       (0x1U<<11)
#define FDCAN1_NDAT2_ND42       (0x1U<<10)
#define FDCAN1_NDAT2_ND41       (0x1U<<9)
#define FDCAN1_NDAT2_ND40       (0x1U<<8)
#define FDCAN1_NDAT2_ND39       (0x1U<<7)
#define FDCAN1_NDAT2_ND38       (0x1U<<6)
#define FDCAN1_NDAT2_ND37       (0x1U<<5)
#define FDCAN1_NDAT2_ND36       (0x1U<<4)
#define FDCAN1_NDAT2_ND35       (0x1U<<3)
#define FDCAN1_NDAT2_ND34       (0x1U<<2)
#define FDCAN1_NDAT2_ND33       (0x1U<<1)
#define FDCAN1_NDAT2_ND32       (0x1U<<0)

// RXF0C Configuration

#define FDCAN1_RXF0C_F0WM       (0xFFU<<24)
#define FDCAN1_RXF0C_F0WM_0     (0x1U<<24)
#define FDCAN1_RXF0C_F0S        (0xFFU<<16)
#define FDCAN1_RXF0C_F0S_0      (0x1U<<16)
#define FDCAN1_RXF0C_F0SA       (0x3FFFU<<2)
#define FDCAN1_RXF0C_F0SA_0     (0x1U<<2)

// RXF0S Configuration

#define FDCAN1_RXF0S_RF0L       (0x1U<<25)
#define FDCAN1_RXF0S_F0F        (0x1U<<24)
#define FDCAN1_RXF0S_F0P        (0x3FU<<16)
#define FDCAN1_RXF0S_F0P_0      (0x1U<<16)
#define FDCAN1_RXF0S_F0G        (0x3FU<<8)
#define FDCAN1_RXF0S_F0G_0      (0x1U<<8)
#define FDCAN1_RXF0S_F0FL       (0x7FU<<0)
#define FDCAN1_RXF0S_F0FL_0     (0x1U<<0)

// RXF0A Configuration

#define FDCAN1_RXF0A_FA01       (0x3FU<<0)
#define FDCAN1_RXF0A_FA01_0     (0x1U<<0)

// RXBC Configuration

