Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_fdcan1.h
#define FDCAN1_RXBC_RBSA        (0x3FFFU<<2)
#define FDCAN1_RXBC_RBSA_0      (0x1U<<2)

// RXF1C Configuration

#define FDCAN1_RXF1C_F1WM       (0x7FU<<24)
#define FDCAN1_RXF1C_F1WM_0     (0x1U<<24)
#define FDCAN1_RXF1C_F1S        (0x7FU<<16)
#define FDCAN1_RXF1C_F1S_0      (0x1U<<16)
#define FDCAN1_RXF1C_F1SA       (0x3FFFU<<2)
#define FDCAN1_RXF1C_F1SA_0     (0x1U<<2)

// RXF1S Configuration

#define FDCAN1_RXF1S_DMS        (0x3U<<30)
#define FDCAN1_RXF1S_DMS_0      (0x1U<<30)
#define FDCAN1_RXF1S_RF1L       (0x1U<<25)
#define FDCAN1_RXF1S_F1F        (0x1U<<24)
#define FDCAN1_RXF1S_F1PI       (0x7FU<<16)
#define FDCAN1_RXF1S_F1PI_0     (0x1U<<16)
#define FDCAN1_RXF1S_F1GI       (0x7FU<<8)
#define FDCAN1_RXF1S_F1GI_0     (0x1U<<8)
#define FDCAN1_RXF1S_F1FL       (0x7FU<<0)
#define FDCAN1_RXF1S_F1FL_0     (0x1U<<0)

// RXF1A Configuration

#define FDCAN1_RXF1A_F1AI       (0x3FU<<0)
#define FDCAN1_RXF1A_F1AI_0     (0x1U<<0)

// RXESC Configuration

#define FDCAN1_RXESC_RBDS       (0x7U<<8)
#define FDCAN1_RXESC_RBDS_0     (0x1U<<8)
#define FDCAN1_RXESC_F1DS       (0x7U<<4)
#define FDCAN1_RXESC_F1DS_0     (0x1U<<4)
#define FDCAN1_RXESC_F0DS       (0x7U<<0)
#define FDCAN1_RXESC_F0DS_0     (0x1U<<0)

// TXBC Configuration

#define FDCAN1_TXBC_TFQM        (0x1U<<30)
#define FDCAN1_TXBC_TFQS        (0x3FU<<24)
#define FDCAN1_TXBC_TFQS_0      (0x1U<<24)
#define FDCAN1_TXBC_NDTB        (0x3FU<<16)
#define FDCAN1_TXBC_NDTB_0      (0x1U<<16)
#define FDCAN1_TXBC_TBSA        (0x3FFFU<<2)
#define FDCAN1_TXBC_TBSA_0      (0x1U<<2)

// TXFQS Configuration

#define FDCAN1_TXFQS_TFQF       (0x1U<<21)
#define FDCAN1_TXFQS_TFQPI      (0x1FU<<16)
#define FDCAN1_TXFQS_TFQPI_0    (0x1U<<16)
#define FDCAN1_TXFQS_TFGI       (0x1FU<<8)
#define FDCAN1_TXFQS_TFGI_0     (0x1U<<8)
#define FDCAN1_TXFQS_TFFL       (0x3FU<<0)
#define FDCAN1_TXFQS_TFFL_0     (0x1U<<0)

// TXESC Configuration

#define FDCAN1_TXESC_TBDS       (0x7U<<0)
#define FDCAN1_TXESC_TBDS_0     (0x1U<<0)

// TXBRP Configuration

#define FDCAN1_TXBRP_TRP        (0xFFFFFFFFU<<0)
#define FDCAN1_TXBRP_TRP_0      (0x1U<<0)

// TXBAR Configuration

#define FDCAN1_TXBAR_AR         (0xFFFFFFFFU<<0)
#define FDCAN1_TXBAR_AR_0       (0x1U<<0)

// TXBCR Configuration

#define FDCAN1_TXBCR_CR         (0xFFFFFFFFU<<0)
#define FDCAN1_TXBCR_CR_0       (0x1U<<0)

// TXBTO Configuration

#define FDCAN1_TXBTO_TO         (0xFFFFFFFFU<<0)
#define FDCAN1_TXBTO_TO_0       (0x1U<<0)

// TXBCF Configuration

#define FDCAN1_TXBCF_CF         (0xFFFFFFFFU<<0)
#define FDCAN1_TXBCF_CF_0       (0x1U<<0)

// TXBTIE Configuration

#define FDCAN1_TXBTIE_TIE       (0xFFFFFFFFU<<0)
#define FDCAN1_TXBTIE_TIE_0     (0x1U<<0)

// TXBCIE Configuration

#define FDCAN1_TXBCIE_CF        (0xFFFFFFFFU<<0)
#define FDCAN1_TXBCIE_CF_0      (0x1U<<0)

// TXEFC Configuration

#define FDCAN1_TXEFC_EFWM       (0x3FU<<24)
#define FDCAN1_TXEFC_EFWM_0     (0x1U<<24)
#define FDCAN1_TXEFC_EFS        (0x3FU<<16)
#define FDCAN1_TXEFC_EFS_0      (0x1U<<16)
#define FDCAN1_TXEFC_EFSA       (0x3FFFU<<2)
#define FDCAN1_TXEFC_EFSA_0     (0x1U<<2)

// TXEFS Configuration

#define FDCAN1_TXEFS_TEFL       (0x1U<<25)
#define FDCAN1_TXEFS_EFF        (0x1U<<24)
#define FDCAN1_TXEFS_EFPI       (0x1FU<<16)
#define FDCAN1_TXEFS_EFPI_0     (0x1U<<16)
#define FDCAN1_TXEFS_EFGI       (0x1FU<<8)
#define FDCAN1_TXEFS_EFGI_0     (0x1U<<8)
#define FDCAN1_TXEFS_EFFL       (0x3FU<<0)
#define FDCAN1_TXEFS_EFFL_0     (0x1U<<0)

// TXEFA Configuration

#define FDCAN1_TXEFA_EFAI       (0x1FU<<0)
#define FDCAN1_TXEFA_EFAI_0     (0x1U<<0)

// TTTMC Configuration

#define FDCAN1_TTTMC_TME        (0x7FU<<16)
#define FDCAN1_TTTMC_TME_0      (0x1U<<16)
#define FDCAN1_TTTMC_TMSA       (0x3FFFU<<2)
#define FDCAN1_TTTMC_TMSA_0     (0x1U<<2)

// TTRMC Configuration

#define FDCAN1_TTRMC_RMPS       (0x1U<<31)
#define FDCAN1_TTRMC_XTD        (0x1U<<30)
#define FDCAN1_TTRMC_RID        (0x1FFFFFFFU<<0)
#define FDCAN1_TTRMC_RID_0      (0x1U<<0)

// TTOCF Configuration

#define FDCAN1_TTOCF_EVTP       (0x1U<<26)
#define FDCAN1_TTOCF_ECC        (0x1U<<25)
#define FDCAN1_TTOCF_EGTF       (0x1U<<24)
#define FDCAN1_TTOCF_AWL        (0xFFU<<16)
#define FDCAN1_TTOCF_AWL_0      (0x1U<<16)
#define FDCAN1_TTOCF_EECS       (0x1U<<15)
#define FDCAN1_TTOCF_IRTO       (0x7FU<<8)
#define FDCAN1_TTOCF_IRTO_0     (0x1U<<8)
#define FDCAN1_TTOCF_LDSDL      (0x7U<<5)
#define FDCAN1_TTOCF_LDSDL_0    (0x1U<<5)
#define FDCAN1_TTOCF_TM         (0x1U<<4)
#define FDCAN1_TTOCF_GEN        (0x1U<<3)
#define FDCAN1_TTOCF_OM         (0x3U<<0)
#define FDCAN1_TTOCF_OM_0       (0x1U<<0)

// TTMLM Configuration

#define FDCAN1_TTMLM_ENTT       (0xFFFU<<16)
#define FDCAN1_TTMLM_ENTT_0     (0x1U<<16)
#define FDCAN1_TTMLM_TXEW       (0xFU<<8)
#define FDCAN1_TTMLM_TXEW_0     (0x1U<<8)
#define FDCAN1_TTMLM_CSS        (0x3U<<6)
#define FDCAN1_TTMLM_CSS_0      (0x1U<<6)
#define FDCAN1_TTMLM_CCM        (0x3FU<<0)
#define FDCAN1_TTMLM_CCM_0      (0x1U<<0)

// TURCF Configuration

#define FDCAN1_TURCF_ELT        (0x1U<<31)
#define FDCAN1_TURCF_DC         (0x3FFFU<<16)
#define FDCAN1_TURCF_DC_0       (0x1U<<16)
#define FDCAN1_TURCF_NCL        (0xFFFFU<<0)
#define FDCAN1_TURCF_NCL_0      (0x1U<<0)

// TTOCN Configuration

#define FDCAN1_TTOCN_LCKC       (0x1U<<15)
#define FDCAN1_TTOCN_ESCN       (0x1U<<13)
#define FDCAN1_TTOCN_NIG        (0x1U<<12)
#define FDCAN1_TTOCN_TMG        (0x1U<<11)
#define FDCAN1_TTOCN_FGP        (0x1U<<10)
#define FDCAN1_TTOCN_GCS        (0x1U<<9)
#define FDCAN1_TTOCN_TTIE       (0x1U<<8)
#define FDCAN1_TTOCN_TMC        (0x3U<<6)
#define FDCAN1_TTOCN_TMC_0      (0x1U<<6)
#define FDCAN1_TTOCN_RTIE       (0x1U<<5)
#define FDCAN1_TTOCN_SWS        (0x3U<<3)
#define FDCAN1_TTOCN_SWS_0      (0x1U<<3)
#define FDCAN1_TTOCN_SWP        (0x1U<<2)
#define FDCAN1_TTOCN_ECS        (0x1U<<1)
#define FDCAN1_TTOCN_SGT        (0x1U<<0)

// CAN_TTGTP Configuration

#define FDCAN1_CAN_TTGTP_CTP    (0xFFFFU<<16)
#define FDCAN1_CAN_TTGTP_CTP_0  (0x1U<<16)
#define FDCAN1_CAN_TTGTP_NCL    (0xFFFFU<<0)
#define FDCAN1_CAN_TTGTP_NCL_0  (0x1U<<0)

// TTTMK Configuration

